SM_для_EDT/src/Catalogs/vftШаблоныРДО/vftШаблоныРДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftШаблоныРДО</name>
  <attributes>
    <name>КодШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможноАвтоматическоеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРДО</name>
    <type>
      <types>CatalogRef.впМодельРДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаВидаОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортовыйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФайла</name>
    <attributes>
      <name>Структура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединятьСПредыдущей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьЕслиНеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаполнятьПослеПараметра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбязательныеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоНаНачалоМесяца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыОпераций</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>CatalogRef.vftТиповыеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftШаблоныРДО/ObjectModule.bsl
&НаСервере
Функция ПолучитьСписокРеквизитовДляФормыДокумента() Экспорт
	ИдентификаторыПоказателейФормулы = Новый Массив;
	Для каждого Строка Из СтруктураФайла Цикл
		НовыеИдентификаторы = vftШаблоныРДО.ИдентификаторыПоказателейФормулы(Строка.Структура);
		Для каждого Ид Из НовыеИдентификаторы Цикл
			ИдентификаторыПоказателейФормулы.Добавить(Ид);	
		КонецЦикла; 	
	КонецЦикла;
	Возврат ИдентификаторыПоказателейФормулы;
КонецФункции

&НаСервере
Функция ПолучитьСписокОбязательныхРеквизитовДляФормыДокумента(Дата) Экспорт
	//raruskzn AydaFZ 18.11.2019 Задача № 17711{
	//Список = ОбязательныеРеквизиты.ВыгрузитьКолонку("Реквизит");
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftШаблоныРДООбязательныеРеквизиты.Реквизит КАК Реквизит
		|ИЗ
		|	Справочник.vftШаблоныРДО.ОбязательныеРеквизиты КАК vftШаблоныРДООбязательныеРеквизиты
		|ГДЕ
		|	(&ЭтоНачалоМесяца
		|			ИЛИ НЕ vftШаблоныРДООбязательныеРеквизиты.ТолькоНаНачалоМесяца)
		|	И vftШаблоныРДООбязательныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ЭтоНачалоМесяца", Дата = НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Список = РезультатЗапроса.ВыгрузитьКолонку("Реквизит");
 
	Возврат Список;

	//raruskzn AydaFZ 18.11.2019}
КонецФункции

&НаСервере
Функция ЭтоОбязательныйРеквизит(ИмяРеквизита) Экспорт
	Если ОбязательныеРеквизиты.Найти(ИмяРеквизита,"Реквзиит")<>Неопределено Тогда
		Возврат Истина;
	Иначе Возврат Ложь;
	КонецЕсли; 
КонецФункции
